---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.RefreshData
source: html/c7608e08-d821-8fd7-c037-7aa3ca4754bc.htm
---
# Autodesk.Revit.DB.TableSectionData.RefreshData Method

Rebuilds the data in this section if it is out of date.

## Syntax (C#)
```csharp
public bool RefreshData()
```

## Returns
True if the data is up to date after the refresh.